models/Usuario.php

SELECT * FROM `usuario` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `usuario` WHERE `login`='gabriel'
---
    public static function findByUsername($username){
        return self::findOne(['login'=>$username]);